package com.company;

public class Admin extends Login{
    // да може да добавя нови клиенти и служители, които имена и пароли да се съдържат в съответните листове

    protected void addNewWorker(){
        //проверка дали вече същестува
        //създаване на име и парола. Записване в съответните листове
    }

    protected void addNewClient(){
        //да провери дали вече съществува
        //създава нов клиент и го записва в лист
    }

    public void workerStatistic(){
        // търси го по име и изкарва колко време е работил и по кои проекти
    }

    //да се направи метод, в който да търси по дадена седмица и да вижда статистики на служителите
}
